If we speak about tables in programming general. There are two things to speak about, matrices and data frames.
The main difference between them in a thoretical way is that matrices can only contain same type of values while dataframes can contain mixed types of values!

In [1]:
#import ing the required modules
import os
import pandas as pd
import numpy as np

In [31]:
#nested list for creating matrix and/or dataframe
samples=[[1,2,3],[4,5,6],[7,8,9]]

In [32]:
samples

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [33]:
#syntax for creating matrix
matrix=np.matrix(samples)
matrix

matrix([[1, 2, 3],
        [4, 5, 6],
        [7, 8, 9]])

In [34]:
#syntax for creating dataframe
samples=[[1,2,3],[4,5,6],['seven','eight','nine']]
df=pd.DataFrame(samples)
df

       0      1     2
0      1      2     3
1      4      5     6
2  seven  eight  nine

In [35]:
#name the header aka the column names
df.columns=['first','second','third']
df

   first second third
0      1      2     3
1      4      5     6
2  seven  eight  nine

In [36]:
#indexing the df aka give names to the rows
df.index=['a','b','c']
df

   first second third
a      1      2     3
b      4      5     6
c  seven  eight  nine

In [15]:
#each selected columns (rows also) of df acts like pandas series (vectors)...
type(df['first'])

pandas.core.series.Series

In [16]:
#...so all the vector based calculations can be executed on them
np.sum(df['first'])

12

In [17]:
df['first']+2

a    3
b    6
c    9
Name: first, dtype: int64

In [18]:
df

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [19]:
#get one row of a dataframe
df.loc['a']

first     1
second    2
third     3
Name: a, dtype: int64

In [21]:
#select the row where condition meets
df.loc[df['second']==5]

   first  second  third
b      4       5      6

In [23]:
#writing matrix to csv file
df.to_csv('../../results/proba.csv')

In [25]:
#reading csv file as a matrix, specifying the index column
callback=pd.read_csv('../../results/proba.csv',index_col=0)

In [26]:
callback

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [27]:
df

   first  second  third
a      1       2      3
b      4       5      6
c      7       8      9

In [28]:
callback==df

   first  second  third
a   True    True   True
b   True    True   True
c   True    True   True